---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnitsAlt
source: html/8578d8c4-61b5-2369-5110-0e2545cd294d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnitsAlt Property

"Alternate Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleLinearUnitsAlt { get; }
```